our-pet-store/app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def details
    id = params[:id]
    @pets = Pet.find(id)

SELECT "pets".* FROM "pets" WHERE "pets"."species" = ? LIMIT ?  [["species", "Dog"], ["LIMIT", 1]]
---
  def dogs
    @dogs = Pet.where(species: "Dog")

SELECT "pets".* FROM "pets" WHERE "pets"."species" = ?  [["species", "Cat"]]
---
  def cats
    @cats = Pet.where(species: "Cat")

SELECT "pets".* FROM "pets" WHERE "pets"."species" = ?  [["species", "Bird"]]
---
  def birds
    @birds = Pet.where(species: "Bird")